// メイン関数を定義します。プログラムの実行はここから始まります。
void main() {
  // 1から100までの整数に対して繰り返し処理を行います。
  for (int i = 1; i <= 100; i++) {
    // 数字が3で割り切れ、かつ5で割り切れる場合
    if (i % 3 == 0 && i % 5 == 0) {
      // 'FizzBuzz'を出力します。
      print('FizzBuzz');
    }
    // 数字が3で割り切れる場合
    else if (i % 3 == 0) {
      // 'Fizz'を出力します。
      print('Fizz');
    }
    // 数字が5で割り切れる場合
    else if (i % 5 == 0) {
      // 'Buzz'を出力します。
      print('Buzz');
    }
    // 上記の条件に一致しない場合
    else {
      // 数字そのものを出力します。
      print(i);
    }
  }
}
